app/controllers/transactions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "email@email.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "email2@email.com"], ["LIMIT", 1]]
INSERT INTO "transactions" ("senderId", "receiverId", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["senderId", 3], ["receiverId", 4], ["value", 0.7], ["created_at", "2021-06-14 22:23:13.468936"], ["updated_at", "2021-06-14 22:23:13.468936"]]
---
  def exchange
    params.permit!
    data = params.to_h
    sender = User.find_by(email: data['from']['email'])
    receiver = User.find_by(email: data['to']['email'])
    amount = data['from']['amount'].to_f

    if !sender.can_pay?(amount) && authorized?
      render json: {'message': 'Sender has not enough funds.'}
    else
      begin
        unless sender.shopkeeper?
          sender.wallet.decrease_balance(amount)

          receiver.wallet.increase_balance(amount)

          NotificationService.new.call # send SMS

          Transaction.create!(senderId: sender.id, receiverId: receiver.id, value: amount)