app/controllers/users_controller.rb

  def create
    if User.create!(user_params)
---
INSERT INTO "users" ("name", "ssn", "email", "password_digest", "kind", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    if @user.destroy!
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]

  def update
    if @user.update!(user_params)
---
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "firstname1"], ["email", "email1@email.com"], ["updated_at", "2021-06-12 07:56:32.521248"], ["id", 2]]

  def set_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]