app/models/user.rb

  def create_default_wallet
    Wallet.create(user_id: self.id, balance: 0.0)
---
INSERT INTO "wallets" ("user_id", "balance", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["balance", 0.0], ["created_at", "2021-06-12 07:19:19.041395"], ["updated_at", "2021-06-12 07:19:19.041395"]]