app/models/wallet.rb

  def increase_balance(amount)
    self.update!(balance: self.balance += amount)
---
UPDATE "wallets" SET "balance" = ?, "updated_at" = ? WHERE "wallets"."id" = ?  [["balance", 7.0], ["updated_at", "2021-06-12 10:23:18.193473"], ["id", 4]]

  def decrease_balance(amount)
    self.update!(balance: self.balance -= amount)
---
UPDATE "wallets" SET "balance" = ?, "updated_at" = ? WHERE "wallets"."id" = ?  [["balance", 5.8], ["updated_at", "2021-06-12 10:23:18.173834"], ["id", 4]]